# -*- coding: utf-8 -*-
from flask import Flask, request, send_from_directory, render_template, jsonify
import os
import json
import random

app = Flask(__name__)

face = ["( .-. )", "( .o.)", "( `·´ )", "( ° ͜ ʖ °)", "( ͡° ͜ʖ ͡°)",
        "( ⚆ _ ⚆ )", "( ︶︿︶)", "( ﾟヮﾟ)", "(\/)(°,,,°)(\/)", "(¬_¬)", "(¬º-°)¬",
        "(¬‿¬)", "(°ロ°)☝", "(´・ω・)っ", "(ó ì_í)", "(ʘᗩʘ')", "(ʘ‿ʘ)", "(͡° ͜ʖ ͡°)",
        "(ಠ_ಠ)", "(ಠ‿ಠ)", "(ಠ⌣ಠ)", "(ಥ_ಥ)", "(ಥ﹏ಥ)", "(ง ͠° ͟ل͜ ͡°)ง", "(ง ͡ʘ ͜ʖ ͡ʘ)ง",
        "(ง •̀_•́)ง", "(ง'̀-'́)ง", "(ง°ل͜°)ง", "(ง⌐□ل͜□)ง", "(ღ˘⌣˘ღ)", "(ᵔᴥᵔ)", "(•ω•)", "(•◡•)/",
        "(⊙ω⊙)", "(⌐■_■)", "(─‿‿─)", "(╯°□°）╯", "(◕‿◕)", "(☞ﾟ∀ﾟ)☞", "(❍ᴥ❍ʋ)", "(っ◕‿◕)っ",
        "(づ｡◕‿‿◕｡)づ", "(ノಠ益ಠ)ノ", "(ノ・∀・)ノ", "(；一_一)", "(｀◔ ω ◔´)", "(｡◕‿‿◕｡)", "(ﾉ◕ヮ◕)ﾉ",
        "=^.^=", "t(-.-t)", "| (• ◡•)|", "~(˘▾˘~)", "¬_¬", "¯\(°_o)/¯", "¯\_(ツ)_/¯", "°Д°", "ɳ༼ຈل͜ຈ༽ɲ",
        "ʅʕ•ᴥ•ʔʃ", "ʕ´•ᴥ•`ʔ", "ʕ•ᴥ•ʔ", "ʕ◉.◉ʔ", "ʕㅇ호ㅇʔ", "ʕ；•`ᴥ•´ʔ", "ʘ‿ʘ", "͡° ͜ʖ ͡°", "ಠ_ಠ",
        "ಠoಠ", "ಠ~ಠ", "ಠ‿ಠ", "ಠ⌣ಠ", "ಠ╭╮ಠ", "ರ_ರ", "ง ͠° ل͜ °)ง", "༼ ͡■ل͜ ͡■༽", "༼ つ ◕_◕ ༽つ", "༼ʘ̚ل͜ʘ̚༽",
        "ᔑ•ﺪ͟͠•ᔐ", "ᕕ( ᐛ )ᕗ", "ᕙ(⇀‸↼‶)ᕗ", "ᕙ༼ຈل͜ຈ༽ᕗ", "ᶘ ᵒᴥᵒᶅ", "≧☉_☉≦", "⊙▃⊙", "⊙﹏⊙", "┌( ಠ_ಠ)┘",
        "╚(ಠ_ಠ)=┐", "◉_◉", "◔ ⌣ ◔", "◔̯◔", "◕‿↼", "◕‿◕", "☉_☉", "☜(⌒▽⌒)☞", "☼.☼", "♥‿♥", "⚆ _ ⚆",
        "✌(-‿-)✌", "〆(・∀・＠)", "ノ( º _ ºノ)", "ノ( ゜-゜ノ)", "ヽ( ͝° ͜ʖ͡°)ﾉ", "ヽ(`Д´)ﾉ", "ヽ༼ʘ̚ل͜ʘ̚༽ﾉ",
        "ヽ༼ຈل͜ຈ༽ง", "ヽ༼ຈل͜ຈ༽ﾉ", "ヽ༼Ὸل͜ຈ༽ﾉ", "ヾ(⌐■_■)ノ", "꒰･◡･๑꒱", "｡◕‿◕｡", "ʕノ◔ϖ◔ʔノ", "ಠ_ರೃ",
        "(ꐦ°᷄д°᷅)", "ヘ（。□°）ヘ", "૮( ᵒ̌ૢཪᵒ̌ૢ )ა", "ψ(｀∇´)ψ", "ಠﭛಠ", "(๑>ᴗ<๑)", "(oT-T)尸", "(✌ﾟ∀ﾟ)☞",
        "ಥ‿ಥ", "( ˘ ³˘)♥", "ヾ(´￢｀)ﾉ", "(•̀o•́)ง", "(•̀.̫•́✧)", "(ᵒ̤̑ ₀̑ ᵒ̤̑)", "\_(ʘ_ʘ)_/", "🤔"]


@app.route('/')
def index():
    work_json = os.path.join(app.static_folder, "", "work.json")
    work = json.load(open(work_json))['work']

    return render_template('index.html', work=work)


@app.errorhandler(404)
def page_not_found(e):
    return render_template('404.html', face="¯\_(ツ)_/¯".decode("utf8")), 404


@app.route('/robots.txt')
def static_from_root():
    return send_from_directory(app.static_folder, request.path[1:])


@app.route('/face')
def lenny_face():
    return jsonify(face=random.choice(face))


if __name__ == "__main__":
    app.run(host='0.0.0.0')
